{ 
  "resources": [{
    "isbn": "1118018370",
    "title": "Lifehacker",
    "creator": "Adam Pash",
    "description": "A new edition, packed with even more clever tricks and methods that make everyday life easier Lifehackers redefine personal productivity with creative and clever methods for making life easier and more enjoyable. This new edition of a perennial bestseller boasts new and exciting tips, tricks, and methods that strike a perfect balance between current technology and common sense solutions for getting things done. Exploring the many ways technology has changed since the previous edition, this new edition has been updated to reflect the latest and greatest in technological and personal productivity. The new hacks run the gamut of working with the latest Windows and Mac operating systems for both Windows and Apple, getting more done with smartphones and their operating systems, and dealing with the evolution of the web. Even the most tried-and-true hacks have been updated to reflect the contemporary tech world and the tools it provides us. Technology is supposed to make our lives easier by helping us work more efficiently. Lifehacker: The Guide to Working Smarter, Faster, and Better, Third Edition is your guide to making that happen!",
    "imageRef": "http://books.google.com/books/content?id=OnfbngEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1118345606",
    "title": "Decoded",
    "creator": "Phil Barden",
    "description": "In this groundbreaking book Phil Barden reveals what decision science explains about people’s purchase behaviour, and specifically demonstrates its value to marketing. He shares the latest research on the motivations behind consumers’ choices and what happens in the human brain as buyers make their decisions. He deciphers the ‘secret codes’ of products, services and brands to explain why people buy them. And finally he shows how to apply this knowledge in day to day marketing to great effect by dramatically improving key factors such as relevance, differentiation and credibility. Shows how the latest insights from the fields of Behavioural Economics, psychology and neuro-economics explain why we buy what we buy Offers a pragmatic framework and guidelines for day-to-day marketing practice on how to employ this knowledge for more effective brand management - from strategy to implementation and NPD. The first book to apply Daniel Kahneman’s Nobel Prize-winning work to marketing and advertising Packed with case studies, this is a must-read for marketers, advertising professionals, web designers, R&D managers, industrial designers, graphic designers in fact anyone whose role or interest focuses on the ‘why’ behind consumer behaviour. Foreword by Rory Sutherland, Executive Creative Director and Vice-Chairman, OgilvyOne London and Vice-Chairman,Ogilvy Group UK Full colour throughout",
    "imageRef": "http://books.google.com/books/content?id=9FgiWOZFydMC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1},
  {
    "isbn": "1119164001",
    "title": "Hey, Whipple, Squeeze This",
    "creator": "Luke Sullivan",
    "description": "Revised edition of the authors Hey Whipple squeeze this!, 20,12.",
    "imageRef": "http://books.google.com/books/content?id=FR-RCgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1455570249",
    "title": "Make Your Bed",
    "creator": "William McRaven",
    "description": "If you want to change the world, start off by making your bed. On May 21, 2014, Admiral William H. McRaven addressed the graduating class of the University of Texas at Austin on their Commencement day. Taking inspiration from the universitys slogan, What starts here changes the world, he shared the ten principles he learned during Navy Seal training that helped him overcome challenges not only in his training and long Naval career, but also throughout his life; and he explained how anyone can use these basic lessons to change themselves-and the world-for the better. Admiral McRavens original speech went viral with over 10 million views. Building on the core tenets laid out in his speech, McRaven now recounts tales from his own life and from those of people he encountered during his military service who dealt with hardship and made tough decisions with determination, compassion, honor, and courage. Told with great humility and optimism, this timeless book provides simple wisdom, practical advice, and words of encouragement that will inspire readers to achieve more, even in lifes darkest moments.",
    "imageRef": "http://books.google.com/books/content?id=QmZMvgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1439156816",
    "title": "On Writing: 10th Anniversary Edition",
    "creator": "Stephen King",
    "description": "“Long live the King” hailed Entertainment Weekly upon publication of Stephen King’s On Writing. Part memoir, part master class by one of the bestselling authors of all time, this superb volume is a revealing and practical view of the writer’s craft, comprising the basic tools of the trade every writer must have. King’s advice is grounded in his vivid memories from childhood through his emergence as a writer, from his struggling early career to his widely reported, near-fatal accident in 1999—and how the inextricable link between writing and living spurred his recovery. Brilliantly structured, friendly and inspiring, On Writing will empower and entertain everyone who reads it—fans, writers, and anyone who loves a great story well told.",
    "imageRef": "http://books.google.com/books/content?id=qSZmQgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1119000602",
    "title": "The Power to Compete",
    "creator": "Hiroshi Mikitani",
    "description": "If youre as interested in Japan as I am, I think youll find that The Power to Compete is a smart and thought-provoking look at the future of a fascinating country. - Bill Gates, 5 Books to Read This Summer Father and son – entrepreneur and economist – search for Japans economic cure The Power to Compete tackles the issues central to the prosperity of Japan – and the world – in search of a cure for the Japan Disease. As founder and CEO of Rakuten, one of the worlds largest Internet companies, author Hiroshi Mikitani brings an entrepreneurs perspective to bear on the countrys economic stagnation. Through a freewheeling and candid conversation with his economist father, Ryoichi Mikitani, the two examine the issues facing Japan, and explore possible roadmaps to revitalization. How can Japan overhaul its economy, education system, immigration, public infrastructure, and hold its own with China? Their ideas include applying business techniques like Key Performance Indicators to fix the economy, using information technology to cut government bureaucracy, and increasing the number of foreign firms with a head office in Japan. Readers gain rare insight into Japans future, from both academic and practical perspectives on the inside. Mikitani argues that Japans tendency to shun international frameworks and hide from global realities is the root of the problem, while Mikitani Sr.s background as an international economist puts the issue in perspective for a well-rounded look at todays Japan. Examine the causes of Japans endless economic stagnation Discover the current efforts underway to enhance Japans competitiveness Learn how free market Abenomics affected Japans economy long-term See Japans issues from the perspective of an entrepreneur and an economist Japans malaise is seated in a number of economic, business, political, and cultural issues, and this book doesnt shy away from hot topics. More than a discussion of economics, this book is a conversation between father and son as they work through opposing perspectives to help their country find The Power to Compete.",
    "imageRef": "http://books.google.com/books/content?id=xumZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1422124827",
    "title": "Design-driven Innovation",
    "creator": "Roberto Verganti",
    "description": "Until now, the literature on innovation has focused either on radical innovation pushed by technology or incremental innovation pulled by the market. In Design-Driven Innovation: How to Compete by Radically Innovating the Meaning of Products, Roberto Verganti introduces a third strategy, a radical shift in perspective that introduces a bold new way of competing. Design-driven innovations do not come from the market; they create new markets. They dont push new technologies; they push new meanings. Its about having a vision, and taking that vision to your customers. Think of game-changers like Nintendos Wii or Apples iPod. They overturned our understanding of what a video game means and how we listen to music. Customers had not asked for these new meanings, but once they experienced them, it was love at first sight. But where does the vision come from? With fascinating examples from leading European and American companies, Verganti shows that for truly breakthrough products and services, we must look beyond customers and users to those he calls interpreters - the experts who deeply understand and shape the markets they work in. Design-Driven Innovation offers a provocative new view of innovation thinking and practice.",
    "imageRef": "http://books.google.com/books/content?id=rpaj0vLzPRkC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1451666179",
    "title": "Hyperbole and a Half",
    "creator": "Allie Brosh",
    "description": "Collects autobiographical, illustrated essays and cartoons from the authors popular blog and related new material that humorously and candidly deals with her own idiosyncrasies and battles with depression.",
    "imageRef": "http://books.google.com/books/content?id=KYmYAQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1422188612",
    "title": "The First 90 Days, Updated and Expanded",
    "creator": "Michael Watkins",
    "description": "In this updated 10th anniversary edition, an internationally known leadership transition expert, drawing on real-world examples and groundbreaking research on leadership, emphasizes the importance of successful performance during the first 90 days in a new position. 100,000 first printing.",
    "imageRef": "http://books.google.com/books/content?id=RZjBAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1250062187",
    "title": "The Sixth Extinction",
    "creator": "Elizabeth Kolbert",
    "description": "WINNER OF THE PULITZER PRIZE ONE OF THE NEW YORK TIMES BOOK REVIEWS 10 BEST BOOKS OF THE YEAR A NEW YORK TIMES BESTSELLER A NATIONAL BOOK CRITICS CIRCLE AWARD FINALIST A major book about the future of the world, blending intellectual and natural history and field reporting into a powerful account of the mass extinction unfolding before our eyes Over the last half-billion years, there have been Five mass extinctions, when the diversity of life on earth suddenly and dramatically contracted. Scientists around the world are currently monitoring the sixth extinction, predicted to be the most devastating extinction event since the asteroid impact that wiped out the dinosaurs. This time around, the cataclysm is us. In prose that is at once frank, entertaining, and deeply informed, New Yorker writer Elizabeth Kolbert tells us why and how human beings have altered life on the planet in a way no species has before. Interweaving research in half a dozen disciplines, descriptions of the fascinating species that have already been lost, and the history of extinction as a concept, Kolbert provides a moving and comprehensive account of the disappearances occurring before our very eyes. She shows that the sixth extinction is likely to be mankinds most lasting legacy, compelling us to rethink the fundamental question of what it means to be human.",
    "imageRef": "http://books.google.com/books/content?id=vi-loAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1422155633",
    "title": "Empowered",
    "creator": "Josh Bernoff",
    "description": "Offers a path for companies to foster innovation by encouraging creative employees to experiment with new technologies in the workplace. Co-written by the co-author of Groundswell.",
    "imageRef": "http://books.google.com/books/content?id=qzE3pYotFvYC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1250062381",
    "title": "Overwhelmed",
    "creator": "Brigid Schulte",
    "description": "This book asks whether working mothers in America -- or anywhere -- can ever find true leisure time. Or are our brains, our partners, our culture, our bosses, making it impossible for us to experience anything but contained time, in which we are in frantic life management mode until we are sound asleep?--",
    "imageRef": "http://books.google.com/books/content?id=tsyMBgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1250183863",
    "title": "Extreme Ownership",
    "creator": "Jocko Willink",
    "description": "An updated edition of the blockbuster bestselling leadership book that took America and the world by storm, two U.S. Navy SEAL officers who led the most highly decorated special operations unit of the Iraq War demonstrate how to apply powerful leadership principles from the battlefield to business and life. Combat, the most intense and dynamic environment imaginable, teaches the toughest leadership lessons, with absolutely everything at stake. Jocko Willink and Leif Babin learned this reality first-hand on the most violent and dangerous battlefield in Iraq. As leaders of SEAL Team Three’s Task Unit Bruiser, their mission was one many thought impossible: help U.S. forces secure Ramadi, a violent, insurgent-held city deemed “all but lost.” In gripping, firsthand accounts of heroism, tragic loss, and hard-won victories, they learned that leadership—at every level—is the most important factor in whether a team succeeds or fails. Willink and Babin returned home from deployment and instituted SEAL leadership training to pass on their harsh lessons learned in combat to help forge the next generation of SEAL leaders. After leaving the SEAL Teams, they launched a company, Echelon Front, to teach those same leadership principles to leaders in businesses, companies, and organizations across the civilian sector. Since that time, they have trained countless leaders and worked with hundreds of companies in virtually every industry across the U.S. and internationally, teaching them how to develop their own high-performance teams and most effectively lead those teams to dominate their battlefields. Since it’s release in October 2015, Extreme Ownership has revolutionized leadership development and set a new standard for literature on the subject. Required reading for many of the most successful organizations, it has become an integral part of the official leadership training programs for scores of business teams, military units, and first responders. Detailing the mindset and principles that enable SEAL units to accomplish the most difficult combat missions, Extreme Ownership demonstrates how to apply them to any team or organization, in any leadership environment. A compelling narrative with powerful instruction and direct application, Extreme Ownership challenges leaders everywhere to fulfill their ultimate purpose: lead and win.",
    "imageRef": "http://books.google.com/books/content?id=RNA3DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1400066115",
    "title": "Mom & Me & Mom",
    "creator": "Maya Angelou",
    "description": "The celebrated author shares the intimate story of her relationship with her mother, relating the events that prompted her mother to send young Angela to Arkansas to live with her grandmother and the complicated fallout that shaped their family life.",
    "imageRef": "http://books.google.com/books/content?id=IdVPuUutku0C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1401307787",
    "title": "Wherever You Go, There You Are",
    "creator": "Jon Kabat-Zinn",
    "description": "An updated tenth anniversary edition of the best-selling guide explains how anyone can use mindfulness--the Buddhist art of living each moment fully as it happens--to reduce anxiety, achieve inner peace, find fulfillment, and enrich ones life, accompanied by a series of anecdotes, instructions, and meditations. Reprint. 100,000 first printing.",
    "imageRef": "http://books.google.com/books/content?id=dQ4RAQAAIAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1455554790",
    "title": "Work Rules!",
    "creator": "Laszlo Bock",
    "description": "NEW YORK TIMES BESTSELLERWALL STREET JOURNAL BESTSELLER From the visionary head of Googles innovative People Operations comes a groundbreaking inquiry into the philosophy of work-and a blueprint for attracting the most spectacular talent to your business and ensuring that they succeed. We spend more time working than doing anything else in life. Its not right that the experience of work should be so demotivating and dehumanizing. So says Laszlo Bock, head of People Operations at the company that transformed how the world interacts with knowledge. This insight is the heart of WORK RULES!, a compelling and surprisingly playful manifesto that offers lessons including: Take away managers power over employees Learn from your best employees-and your worst Hire only people who are smarter than you are, no matter how long it takes to find them Pay unfairly (its more fair!) Dont trust your gut: Use data to predict and shape the future Default to open-be transparent and welcome feedback If youre comfortable with the amount of freedom youve given your employees, you havent gone far enough. Drawing on the latest research in behavioral economics and a profound grasp of human psychology, WORK RULES! also provides teaching examples from a range of industries-including lauded companies that happen to be hideous places to work and little-known companies that achieve spectacular results by valuing and listening to their employees. Bock takes us inside one of historys most explosively successful businesses to reveal why Google is consistently rated one of the best places to work in the world, distilling 15 years of intensive worker R&D into principles that are easy to put into action, whether youre a team of one or a team of thousands. WORK RULES! shows how to strike a balance between creativity and structure, leading to success you can measure in quality of life as well as market share. Read it to build a better company from within rather than from above; read it to reawaken your joy in what you do.",
    "imageRef": "http://books.google.com/books/content?id=_MW7oQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1416547878",
    "title": "The Bully Pulpit",
    "creator": "Doris Kearns Goodwin",
    "description": "A dynamic history of the muckracking press and the first decade of the Progressive era as told through the intense friendship of Theodore Roosevelt and William Howard Taft--a close relationship that strengthens both men before it ruptures in 1912 when they engage in a brutal fight for the presidential nomination that cripples the progressive wing of the Republican Party, causing Democrat Woodrow Wilson to be elected, and changing the countrys history.",
    "imageRef": "http://books.google.com/books/content?id=QY9qBAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1497644895",
    "title": "Business Adventures",
    "creator": "John Brooks",
    "description": "Presents twelve stories of success or disasters among prominent companies, including the disastrous Ford Edsel, the rise of Xerox, and the scandal at General Electric.",
    "imageRef": "http://books.google.com/books/content?id=IfK6oAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1401307450",
    "title": "Scar Tissue",
    "creator": "Anthony Kiedis",
    "description": "Now in paperback, the New York Times bestseller by one of rocks most provocative figures Scar Tissue is Anthony Kiediss searingly honest memoir of a life spent in the fast lane. In 1983, four self-described knuckleheads burst out of the mosh-pitted mosaic of the neo-punk rock scene in L.A. with their own unique brand of cosmic hardcore mayhem funk. Over twenty years later, the Red Hot Chili Peppers, against all odds, have become one of the most successful bands in the world. Though the band has gone through many incarnations, Anthony Kiedis, the groups lyricist and dynamic lead singer, has been there for the whole roller-coaster ride. Whether hes recollecting the influence of the beautiful, strong women who have been his muses, or retracing a journey that has included appearances as diverse as a performance before half a million people at Woodstock or an audience of one at the humble compound of the exiled Dalai Lama, Kiedis shares a compelling story about the price of success and excess. Scar Tissue is a story of dedication and debauchery, of intrigue and integrity, of recklessness and redemption -- a story that could only have come out of the world of rock.",
    "imageRef": "http://books.google.com/books/content?id=g04AAgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1401309704",
    "title": "The Power of Less",
    "creator": "Leo Babauta",
    "description": "The Power of Less is a blueprint for reducing the clutter, noise, and unnecessary work that fills a modern day. Babautas lessons enable readers to do less, be more effective, get more done, and simplify their lives.",
    "imageRef": "http://books.google.com/books/content?id=Idt1vpHjX8QC&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1101980133",
    "title": "Blockchain Revolution",
    "creator": "Don Tapscott",
    "description": "The Internet as we know it is great for collaboration and communication, but is deeply flawed when it comes to commerce and privacy. The new blockchain technology facilitates peer-to-peer transactions without any intermediary such as a bank or governing body. Keeping the users information anonymous, the blockchain validates and keeps a permanent public record of all transactions. That means that your personal information is private and secure, while all activity is transparent and incorruptible--reconciled by mass collaboration and stored in code on a digital ledger. With its advent, we will not need to trust each other in the traditional sense, because trust is built into the system itself.",
    "imageRef": "http://books.google.com/books/content?id=UOQCswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1119082943",
    "title": "Discover Your True North",
    "creator": "Bill George",
    "description": "Revised edition of the authors Finding your true north, 2008.",
    "imageRef": "http://books.google.com/books/content?id=rxCeCAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1259589382",
    "title": "The Future Workplace Experience: 10 Rules For Mastering Disruption in Recruiting and Engaging Employees",
    "creator": "Kevin J. Mulcahy",
    "description": "DISRUPTIVE TECHNOLOGIES. THE GIG ECONOMY. BREADWINNER MOMS. DATA-DRIVEN RECRUITING. PERSONALIZED LEARNING. In a business landscape rocked by constant change and turmoil, companies like Airbnb, Cisco, GE Digital, Google, IBM, and Microsoft are reinventing the future of work. What is it that makes these companies so different? They’re strategic, they’re agile, and they’re customer-focused. But, most important, they’re game changers. And their workplace practices reflect this. The Future Workplace Experience presents an actionable framework for meeting today’s toughest business disruptions head-on. It guides you step-by-step through the process of recruiting top employees and building an engaged culture—one that will drive your company to long-term success. Two of today’s leading voices on the future of work, provide 10 rules for rethinking, reimagining, and reinventing your organization, including: • MAKE THE WORKPLACE AN EXPERIENCE • BE AN AGILE LEADER • CONSIDER TECHNOLOGY AN ENABLER AND DISTRUPTOR • EMBRACE ON-DEMAND LEARNING • TAP THE POWER OF MULTIPLE GENERATIONS • PLAN FOR MORE GIG ECONOMY WORKERS Everything we took for granted in the past— from what we expect from our jobs to whom we work with and how—is changing before our eyes. The strongest organizations today are “learning machines.” New challenges require new solutions—and these organizations are finding them. If you want to compete in the years to come, you have to meet the future now. The Future Workplace Experience is your playbook for taking your organization to the top of your industry.",
    "imageRef": "http://books.google.com/books/content?id=61IcswEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1422186415",
    "title": "Driven to Distraction at Work",
    "creator": "Ned Hallowell",
    "description": "Identifying the underlying reasons why people really lose their ability to focus at work and drawing on case studies, a leading authority on ADD and ADHD presents a set of reliable techniques that will help anyone regain control of their attention and most productive mental state in the workplace. By the best-selling author of Driven to Distraction. 25,000 first printing.",
    "imageRef": "http://books.google.com/books/content?id=WZdIBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1422139069",
    "title": "Employees First, Customers Second",
    "creator": "Vineet Nayar",
    "description": "Imagine a management philosophy based not upon serving a companys customers, but on serving the companys employees. Vineet Nayar, CEO of HCL Technologies in India, has put such a philosophy into practice with remarkable results. His employee first, customer second mantra has been recognized globally as an example of organizational innovation, and was deemed a new and radical management philosophy ripe for the picking in the Western world by Business Week. In this book, Nayar himself describes his blunt refusal to treat the flesh and blood of HCL--its people--as human resource or as intellectual capital or even as an asset like all its other assets-and how his unique perspective led to an holistic transformation of his organization. By putting employees on top of the organizational pyramid, he argues, your company can fully realize the value created in the interface between customers and employees. This book leads managers and executives through the five core aspects of Nayars approach, demonstrating how to create a sense of urgency, overhaul incentives and reporting structures, foster transparency in communications and feedback, provide platforms for achievement and personal growth, and finally recognize the potential of every individual in the organization. The Employee First philosophy should be the fulcrum of the transformation journey of any organization.",
    "imageRef": "http://books.google.com/books/content?id=yvmezKEVvhQC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1118278720",
    "title": "Should We Eat Meat Evolution and Consequences of Modern Carnivory",
    "creator": "Vaclav Smil",
    "description": "Meat eating is often a contentious subject, whether considering the technical, ethical, environmental, political, or health-related aspects of production and consumption. This book is a wide-ranging and interdisciplinary examination and critique of meat consumption by humans, throughout their evolution and around the world. Setting the scene with a chapter on meat’s role in human evolution and its growing influence during the development of agricultural practices, the book goes on to examine modern production systems, their efficiencies, outputs, and impacts. The major global trends of meat consumption are described in order to find out what part its consumption plays in changing modern diets in countries around the world. The heart of the book addresses the consequences of the massive carnivory of western diets, looking at the inefficiencies of production and at the huge impacts on land, water, and the atmosphere. Health impacts are also covered, both positive and negative. In conclusion, the author looks forward at his vision of “rational meat eating”, where environmental and health impacts are reduced, animals are treated more humanely, and alternative sources of protein make a higher contribution. Should We Eat Meat? is not an ideological tract for or against carnivorousness but rather a careful evaluation of meats roles in human diets and the environmental and health consequences of its production and consumption. It will be of interest to a wide readership including professionals and academics in food and agricultural production, human health and nutrition, environmental science, and regulatory and policy making bodies around the world.",
    "imageRef": "http://books.google.com/books/content?id=Vm-pMQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1501135910",
    "title": "Shoe Dog",
    "creator": "Phil Knight",
    "description": "IN this candid AND riveting memoir, FOR the FIRST TIME ever, Nike founder AND CEO Phil Knight shares the inside story of the company’s early days AS an intrepid START-up AND its evolution INTO ONE of the world’s most iconic, game-changing, AND profitable brands. IN 1962, fresh OUT of business school, Phil Knight borrowed $50 FROM his father AND created a company WITH a SIMPLE mission: import high-quality, low-cost athletic shoes FROM Japan. Selling the shoes FROM the trunk of his lime green Plymouth Valiant, Knight grossed $8,000 his FIRST year. Today, Nike’s annual sales top $30 billion. IN an age of startups, Nike IS the ne plus ultra of ALL startups, AND the swoosh has become a revolutionary, globe-spanning icon, ONE of the most ubiquitous AND recognizable symbols IN the world today. But Knight, the man behind the swoosh, has always remained a mystery. Now, FOR the FIRST TIME, IN a memoir that IS candid, humble, gutsy, AND wry, he tells his story, beginning WITH his crossroads moment. AT 24, AFTER backpacking around the world, he decided TO take the unconventional path, TO START his own business—a business that would be DYNAMIC, different. Knight details the many risks AND daunting setbacks that stood BETWEEN him AND his dream—along WITH his early triumphs. Above ALL, he recalls the formative relationships WITH his FIRST partners AND employees, a ragtag group of misfits AND seekers who became a tight-knit band of brothers. Together, harnessing the transcendent power of a shared mission, AND a deep belief IN the spirit of sport, they built a brand that CHANGED everything.",
    "imageRef": "http://books.google.com/books/content?id=UmyfjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1451620675",
    "title": "Marmee & Louisa",
    "creator": "Eve LaPlante",
    "description": "A great niece AND cousin of Louisa May Alcott draws ON newly uncovered family papers TO present a revisionist portrait of Louisas relationship with her mother, discussing how Abigail May served as the intellectual and emotional center of Louisas life.",
    "imageRef": "http://books.google.com/books/content?id=hmwTAgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1455546046",
    "title": "Nice Girls Dont Get the Corner Office",
    "creator": "Lois P. Frankel",
    "description": "BEFORE YOU WERE TOLD TO LEAN IN, DR. LOIS FRANKEL TOLD YOU HOW TO GET THAT CORNER OFFICE The New York Times bestseller, which for 10 years has been a must-have for women in business, is now completely revised and updated. In this new edition, internationally recognized executive coach Lois P. Frankel reveals a distinctive set of behaviors-over 130 in all-that women learn in girlhood that ultimately sabotage them as adults. She teaches you how to eliminate these unconscious mistakes that could be holding you back and offers invaluable coaching tips that can easily be incorporated into your social and business skills. The results for hundreds of thousands of women have been career opportunities they never thought possible-at every stage of their career, from entry-level to the corner office! Stop making nice girl errors that can become career pitfalls, such as: Mistake #13: Avoiding office politics. If you dont play the game, you cant possibly win. Mistake #21: Multi-tasking. Just because you can do something, doesnt mean you should do it. Mistake #54: Failure to negotiate. Dont equate negotiation with confrontation. Mistake #70: Inappropriate use of social media. Once its out there, its hard to put the toothpaste back in the tube. Mistake #82: Asking permission. Children, not adults, ask for approval. Be direct, be confident.",
    "imageRef": "http://books.google.com/books/content?id=ghcfnAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1477824006",
    "title": "Unlocking Potential",
    "creator": "Michael K. Simpson",
    "description": "Provides a guide for executives seeking to coach and motivate their employees, explaining how to encourage and develop the talents of their staff to increase productivity, profitability, loyalty, and customer focus.",
    "imageRef": "http://books.google.com/books/content?id=6rXOjwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1119209595",
    "title": "The Ideal Team Player",
    "creator": "Patrick M. Lencioni",
    "description": "In his classic book, The Five Dysfunctions of a Team, Patrick Lencioni laid out a groundbreaking approach for tackling the perilous group behaviors that destroy teamwork. Here he turns his focus to the individual, revealing the three indispensable virtues of an ideal team player. In The Ideal Team Player, Lencioni tells the story of Jeff Shanley, a leader desperate to save his uncle’s company by restoring its cultural commitment to teamwork. Jeff must crack the code on the virtues that real team players possess, and then build a culture of hiring and development around those virtues. Beyond the fable, Lencioni presents a practical framework and actionable tools for identifying, hiring, and developing ideal team players. Whether you’re a leader trying to create a culture around teamwork, a staffing professional looking to hire real team players, or a team player wanting to improve yourself, this book will prove to be as useful as it is compelling.",
    "imageRef": "http://books.google.com/books/content?id=slTWCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1439177732",
    "title": "I Am Pilgrim",
    "creator": "Terry Hayes",
    "description": "A breakneck race against time...and an implacable enemy. An anonymous young woman murdered in a run-down hotel, all identifying characteristics dissolved by acid. A father publicly beheaded in the blistering heat of a Saudi Arabian public square. A notorious Syrian biotech expert found eyeless in a Damascus junkyard. Smoldering human remains on a remote mountainside in Afghanistan. A flawless plot to commit an appalling crime against humanity. One path links them all, and only one man can make the journey. Pilgrim.--Publishers website.",
    "imageRef": "http://books.google.com/books/content?id=TI-ZBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1501139150",
    "title": "Leonardo Da Vinci",
    "creator": "Walter Isaacson",
    "description": "A powerful story of an exhilarating mind and life....the book is a study in creativity: how to define it, how to achieve it.—The New Yorker “Majestic . . . Enthralling, masterful, and passionate.”—Kirkus Reviews (starred review) “A monumental tribute to a titanic figure.”—Publishers Weekly (starred review) He was history’s most creative genius. What secrets can he teach us? The author of the acclaimed bestsellers Steve Jobs, Einstein, and Benjamin Franklin brings Leonardo da Vinci to life in this exciting new biography. Based on thousands of pages from Leonardo’s astonishing notebooks and new discoveries about his life and work, Walter Isaacson weaves a narrative that connects his art to his science. He shows how Leonardo’s genius was based on skills we can improve in ourselves, such as passionate curiosity, careful observation, and an imagination so playful that it flirted with fantasy. He produced the two most famous paintings in history, The Last Supper and the Mona Lisa. But in his own mind, he was just as much a man of science and technology. With a passion that sometimes became obsessive, he pursued innovative studies of anatomy, fossils, birds, the heart, flying machines, botany, geology, and weaponry. His ability to stand at the crossroads of the humanities and the sciences, made iconic by his drawing of Vitruvian Man, made him history’s most creative genius. His creativity, like that of other great innovators, came from having wide-ranging passions. He peeled flesh off the faces of cadavers, drew the muscles that move the lips, and then painted history’s most memorable smile. He explored the math of optics, showed how light rays strike the cornea, and produced illusions of changing perspectives in The Last Supper. Isaacson also describes how Leonardo’s lifelong enthusiasm for staging theatrical productions informed his paintings and inventions. Leonardo’s delight at combining diverse passions remains the ultimate recipe for creativity. So, too, does his ease at being a bit of a misfit: illegitimate, gay, vegetarian, left-handed, easily distracted, and at times heretical. His life should remind us of the importance of instilling, both in ourselves and our children, not just received knowledge but a willingness to question it—to be imaginative and, like talented misfits and rebels in any era, to think different.",
    "imageRef": "http://books.google.com/books/content?id=vkA5DwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1501171380",
    "title": "Einstein",
    "creator": "Walter Isaacson",
    "description": "From Isaacson, the bestselling author of Benjamin Franklin, comes the first full biography of Albert Einstein since all his papers have become available--a fully realized portrait of a premier icon of his era.",
    "imageRef": "http://books.google.com/books/content?id=d2WZDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1501173219",
    "title": "All the Light We Cannot See",
    "creator": "Anthony Doerr",
    "description": "From the highly acclaimed, multiple award-winning Anthony Doerr, a stunningly ambitious and beautiful novel about a blind French girl and a German boy whose paths collide in occupied France as both try to survive the devastation of World War II. Marie Laure lives with her father in Paris within walking distance of the Museum of Natural History where he works as the master of the locks (there are thousands of locks in the museum). When she is six, she goes blind, and her father builds her a model of their neighborhood, every house, every manhole, so she can memorize it with her fingers and navigate the real streets with her feet and cane. When the Germans occupy Paris, father and daughter flee to Saint-Malo on the Brittany coast, where Marie-Laures agoraphobic great uncle lives in a tall, narrow house by the sea wall. In another world in Germany, an orphan boy, Werner, grows up with his younger sister, Jutta, both enchanted by a crude radio Werner finds. He becomes a master at building and fixing radios, a talent that wins him a place at an elite and brutal military academy and, ultimately, makes him a highly specialized tracker of the Resistance. Werner travels through the heart of Hitler Youth to the far-flung outskirts of Russia, and finally into Saint-Malo, where his path converges with Marie-Laure. Doerrs gorgeous combination of soaring imagination with observation is electric. Deftly interweaving the lives of Marie-Laure and Werner, Doerr illuminates the ways, against all odds, people try to be good to one another. Ten years in the writing, All the Light We Cannot See is his most ambitious and dazzling work--",
    "imageRef": "http://books.google.com/books/content?id=giaLDgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1517153158",
    "title": "Split Second",
    "creator": "Douglas E. Richards",
    "description": "Nathan Wexler is a brilliant physicist who thinks hes found a way to send matter a split second back into the past. But before he can confirm his findings, he and his wife-to-be, Jenna Morrison, find themselves in a battle for their very lives. Because while time travel to an instant earlier seems useless, Jenna comes to learn that no capability in history has ever been more profound or far-reaching -- back cover.",
    "imageRef": "http://books.google.com/books/content?id=DsAcjgEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1591846404",
    "title": "Turn the Ship Around!",
    "creator": "L. David Marquet",
    "description": "Outlines a model of leadership designed to overcome poor morale, low performance, and high turnover while building engaged, healthy teams.",
    "imageRef": "http://books.google.com/books/content?id=uGaLDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1591847303",
    "title": "Work Simply",
    "creator": "Carson Tate",
    "description": "A forefront productivity expert identifies four major work personality types and challenges popular time-management practices to outline step-by-step recommendations for making work more simple through customized approaches. Includes tables.",
    "imageRef": "http://books.google.com/books/content?id=-2qJDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1591842336",
    "title": "Tribes",
    "creator": "Seth Godin",
    "description": "Describes how individuals can become successful leaders through passion and connection with an interested group, and provides real-life case studies that illustrate this method.",
    "imageRef": "http://books.google.com/books/content?id=7f1DyktinKoC&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1579129463",
    "title": "Leonardos Notebooks",
    "creator": "Leonardo Da Vinci",
    "description": "Now in in a new format, pairs the great masters most important writings with more than 1,000 sketches, drawings, and watercolors in this beautiful and dynamic work.",
    "imageRef": "http://books.google.com/books/content?id=RU5KAAAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1592408419",
    "title": "Daring Greatly",
    "creator": "Brené Brown",
    "description": "Based on twelve years of research, thought leader Dr. Brené Brown argues that vulnerability is not weakness, but rather our clearest path to courage, engagement, and meaningful connection.",
    "imageRef": "http://books.google.com/books/content?id=lZhsnAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1576753441",
    "title": "Leadership and the New Science",
    "creator": "Margaret J. Wheatley",
    "description": "An analysis of organizational dynamics as viewed through a lens of modern scientific theory cites the benefits of change in business, in a new edition that provides examples of profitable non-linear networks and organizations. Original.",
    "imageRef": "http://books.google.com/books/content?id=-s8TuAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1781396809",
    "title": "The Old Man and the Sea",
    "creator": "Ernest Hemingway",
    "description": "The Old Man and the Sea, an apparently simple fable, represents the mature Hemingway at his best. He was awarded the Nobel Prize for Literature soon after its publication, and half a century later it is still one of his most read books.",
    "imageRef": "http://books.google.com/books/content?id=DcoevgAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1591841666",
    "title": "The Dip",
    "creator": "Seth Godin",
    "description": "The author of Permission Marketing and Purple Cow shares insights into knowing when to support or fight corporate systems, explaining how to recognize and drop defunct practices to protect profits, job security, and professional satisfaction.",
    "imageRef": "http://books.google.com/books/content?id=95-xBXd4vn8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1626814236",
    "title": "Exponential Organizations: Why New Organizations Are Ten Times Better, Faster, and Cheaper Than Yours (and What to Do about It)",
    "creator": "Salim Ismail",
    "description": "Exponential Organizations already being hailed as the must-read book of the year by tech industry insiders delivers groundbreaking analysis and insight, as well as how-to advice for companies of any size. It is poised to become this year s Lean Startup, a big business book about innovation.",
    "imageRef": "http://books.google.com/books/content?id=i6wDogEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1585425524",
    "title": "The Now Habit",
    "creator": "Neil A. Fiore",
    "description": "This revised, redesigned edition offers strategies to help the reader understand & deal with the complex role played by technology in promoting procastination in the modern world.",
    "imageRef": "http://books.google.com/books/content?id=obLBn7OKcI8C&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1591845572",
    "title": "The Personal MBA",
    "creator": "Josh Kaufman",
    "description": "Sharing the essentials of sales, marketing, negotiation, strategy, and much more, the creator of PersonalMBA.com shows readers how to master the fundamentals, hone their business instincts, and save a fortune in tuition.",
    "imageRef": "http://books.google.com/books/content?id=NzUMuAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1576759776",
    "title": "Leadership and Self-deception",
    "creator": "Arbinger Institute",
    "description": "This phenomenal bestseller -- over 700,000 copies sold -- changes readers lives and helps them transform their organizations. In this new edition, the text has been updated and revised throughout to make it even more readable and powerful, and a new section has been added that details the many different ways that people are using this book.",
    "imageRef": "http://books.google.com/books/content?id=Wnm2mAEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1936891034",
    "title": "Turning Pro",
    "creator": "Steven Pressfield",
    "description": "The follow-up to his bestseller The War of Art, Turning Pro navigates the passage from the amateur life to a professional practice. You dont need to take a course or buy a product. All you have to do is change your mind. --Steven Pressfield TURNING PRO IS FREE, BUT ITS NOT EASY. When we turn pro, we give up a life that we may have become extremely comfortable with. We give up a self that we have come to identify with and to call our own. TURNING PRO IS FREE, BUT IT DEMANDS SACRIFICE. The passage from amateur to professional is often achieved via an interior odyssey whose trials are survived only at great cost, emotionally, psychologically and spiritually. We pass through a membrane when we turn pro. Its messy and its scary. We tread in blood when we turn pro. WHAT WE GET WHEN WE TURN PRO. What we get when we turn pro is we find our power. We find our will and our voice and we find our self-respect. We become who we always were but had, until then, been afraid to embrace and live out.",
    "imageRef": "http://books.google.com/books/content?id=m7ZbLwEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "006223062X",
    "title": "The Confidence Code",
    "creator": "Katty Kay",
    "description": "Confidence. We want it. We need it. But it can be maddeningly enigmatic and out of reach. The authors of the New York Times bestseller Womenomics deconstruct this essential, elusive, and misunderstood quality and offer a blueprint for bringing more of it into our lives. Is confidence hardwired into the DNA of a lucky few—or can anyone learn it? Is it best expressed by bravado, or is there another way to show confidence? Which is more important: confidence or competence? Why do so many women, even the most successful, struggle with feelings of self-doubt? Is there a secret to channeling our inner confidence? In The Confidence Code, journalists Katty Kay and Claire Shipman travel to the frontiers of neuroscience on a hunt for the confidence gene and reveal surprising new research on its roots in our brains. They visit the worlds leading psychologists who explain how we can all chose to become more confident simply by taking action and courting risk, and how those actions change our physical wiring. They interview women leaders from the worlds of politics, sports, the military, and the arts to learn how they have tapped into this elemental resource. They examine how a lack of confidence impacts our leadership, success, and fulfillment. Ultimately, they argue, while confidence is partly influenced by genetics, it is not a fixed psychological state. Thats the good news. You wont discover it by thinking positive thoughts or by telling yourself (or your children) that you are perfect as you are. You also wont find it by simply squaring your shoulders and faking it. But it does require a choice: less people pleasing and perfectionism and more action, risk taking, and fast failure. Inspiring, insightful, and persuasive, The Confidence Code shows that by acting on our best instincts and by daring to be authentic, women can feel the transformative power of a life on confidence.",
    "imageRef": "http://books.google.com/books/content?id=1AdrnQEACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1591848016",
    "title": "Leaders Eat Last",
    "creator": "Simon Sinek",
    "description": "Finally in paperback: the New York Times bestseller by the acclaimed, bestselling author of Start With Why and Together is Better. Now with an expanded chapter and appendix on leading millennials, based on Simon Sineks viral video Millenials in the workplace (150+ million views). Imagine a world where almost everyone wakes up inspired to go to work, feels trusted and valued during the day, then returns home feeling fulfilled. This is not a crazy, idealized notion. Today, in many successful organizations, great leaders create environments in which people naturally work together to do remarkable things. In his work with organizations around the world, Simon Sinek noticed that some teams trust each other so deeply that they would literally put their lives on the line for each other. Other teams, no matter what incentives are offered, are doomed to infighting, fragmentation and failure. Why? The answer became clear during a conversation with a Marine Corps general. Officers eat last, he said. Sinek watched as the most junior Marines ate first while the most senior Marines took their place at the back of the line. Whats symbolic in the chow hall is deadly serious on the battlefield: Great leaders sacrifice their own comfort--even their own survival--for the good of those in their care. Too many workplaces are driven by cynicism, paranoia, and self-interest. But the best ones foster trust and cooperation because their leaders build what Sinek calls a Circle of Safety that separates the security inside the team from the challenges outside. Sinek illustrates his ideas with fascinating true stories that range from the military to big business, from government to investment banking.",
    "imageRef": "http://books.google.com/books/content?id=6Pe5DgAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1891686003",
    "title": "Advertising Secrets of the Written Word",
    "creator": "Joseph Sugarman",
    "description": "Joseph Sugarman has been recognized worldwide for his ability to create persuasive advertising copy that turns a prospect into a customer. ADVERTISING SECRETS OF THE WRITTEN WORD is a comprehensive textbook that teaches you the step-by-step techniques you can follow to write advertising copy - the same lessons taught at his exclusive $3,000 seminars. The entertainingly illustrated book provides insights into the skills it takes to be a great copywriter & how to develop them. It then takes you into the thought process of ad creation, providing a very disciplined procedure that anybody can follow. A chapter reveals the psychological triggers & how they can be used effectively to cause prospects to exchange their hard-earned money for your product or service. The book also presents many personal stories, advertising examples & many of Sugarmans own ads along with the reasons for their success or failure. Ray Schultz, editor of Direct Magazine says, There is no better model for copywriters or magazine editors than Joe Sugarman. Quotes by Richard Thalheimer, President of The Sharper Image, Jack Canfield, co-author of Chicken Soup for the Soul & Vice President Albert Gore are shown on the back cover.",
    "imageRef": "http://books.google.com/books/content?id=E_3tKAAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1912032996",
    "title": "Think and Grow Rich",
    "creator": "Napoleon Hill",
    "description": "This is the original 1937 version of Napoleon Hills Classic Book: Think and Grow Rich. To the greatest extent possible, the text and formatting have been kept exactly the same as in the original release with the exception of some minor formatting changes.",
    "imageRef": "http://books.google.com/books/content?id=mcKlAQAACAAJ&printsec=frontcover&img=1&zoom=1&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1594631905",
    "title": "To Sell is Human",
    "creator": "Daniel H. Pink",
    "description": "Explores the power of selling while arguing that everyone, including non-salespeople, engages in persuasive or moving behaviors, and discusses how to navigate powerful economic changes while building modern negotiating skills.",
    "imageRef": "http://books.google.com/books/content?id=P0eKDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1620403323",
    "title": "Starting At Zero",
    "creator": "Jimi Hendrix",
    "description": "Weaves together the rock artists own words from interviews, lyrics, and scraps of miscellaneous writings to form a continuous narrative of Hendrixs life from birth to his final four years.",
    "imageRef": "http://books.google.com/books/content?id=JuqnBQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1601427964",
    "title": "The More of Less",
    "creator": "Joshua Becker",
    "description": "Dont Settle for More Most of us know we own too much stuff. We feel the burden of our clutter. We tire of cleaning and managing and organizing. Our toy rooms are messy, our drawers wont close, our closets are filled, and we cant fit our cars in our garages. The evidence of clutter is all around us. Meanwhile, this constant accumulation of stuff slowly begins robbing us of life. It redirects our God-given passions. It steals our greatest potential. It consumes our limited resources. And it distracts us from the very life we wish we were living. But it doesnt have to be this way. One of todays most influential minimalist advocates, Joshua Becker, used to spend his days accumulating more and more. But then he realized how his possessions were not only failing to make him happy, they were actually keeping him from the very things that do. Instead of bringing fulfillment, they brought distraction. In The More of Less, Joshua helps you... * recognize the life-giving benefits of owning less * realize how all the stuff you own is keeping you from pursuing your dreams * craft a personal, practical approach to decluttering your home and life * discover greater contentment, less envy, and more joy * recognize why you buy more than you need * experience the joys of generosity * learn why the best part of minimalism isnt a clean house, its a full life Its time to own your possessions instead of letting them own you. After all, the beauty of minimalism isnt in what it takes away. Its in what it gives. Make Room in Your Life for What You Really Want Maybe you dont need to own all this stuff. After a casual conversation with his neighbor on Memorial Day 2008, Joshua Becker realized he needed a change. He was spending far too much time organizing possessions, cleaning up messes, and looking for more to buy. So Joshua and his wife decided to remove the nonessential possessions from their home and life. Eventually, they sold, donated, or discarded over 60 percent of what they owned. In exchange, they found a life of more freedom, more contentment, more generosity, and more opportunity to pursue the things that mattered most. The More of Less delivers an empowering plan for living more by owning less. With practical suggestions and encouragement to personalize your own minimalist style, Joshua Becker shows you why minimizing possessions is the best way to maximize life. Are you ready for less cleaning, less anxiety, and less stress in your life? Simplicity isnt as complicated as you think.",
    "imageRef": "http://books.google.com/books/content?id=fGPhCwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "030682485X",
    "title": "Roots",
    "creator": "Alex Haley",
    "description": "#1 New York Times Bestseller and winner of the Pulitzer Prize, reissued to coincide with History Channels new event series",
    "imageRef": "http://books.google.com/books/content?id=Tz__CwAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  },
  {
    "isbn": "1565847040",
    "title": "Dr. Seuss Goes to War",
    "creator": "Richard H. Minear",
    "description": "For decades, readers throughout the world have enjoyed the marvelous stories and illustrations of Theodor Seuss Geisel, better known as Dr. Seuss. But few know the work Geisel did as a political cartoonist during World War II, for the New York daily newspaper PM. In these extraordinarily trenchant cartoons, Geisel presents a provocative history of wartime politics (Entertainment Weekly). Dr. Seuss Goes to War features handsome, large-format reproductions of more than two hundred of Geisel’s cartoons, alongside insightful (Booklist) commentary by the historian Richard H. Minear that places them in the context of the national climate they reflect. Pulitzer Prize–winner Art Spiegelman’s introduction places Seuss firmly in the pantheon of the leading political cartoonists of our time.",
    "imageRef": "http://books.google.com/books/content?id=2p2qDQAAQBAJ&printsec=frontcover&img=1&zoom=1&edge=curl&source=gbs_api",
    "active": 1,
    "resourceTypeId": 1
  }],
  "recentReviews": ["1439177732", "1936891034"],
  "recommended": ["1118018370", "1451666179", "1401307787", "1119082943"],
  "collections": {
    "seniorLeadershipTeam": [],
    "boardMembers": [],
    "harvardBusinessReview": [],
    "yearOfBooks": [],
    "billGates": [],
    "forbes": [],
    "adamGrant": [],
    "jimiHendrix": [],
    "einstein": [],
    "malala": [],
    "daVinci": [],
    "suess": [],
    "louisaMay": [],
    "mayaAngelou": [],
    "nelsonMandela": [],
    "business": [],
    "communication": [],
    "innovation": [],
    "leadership": [],
    "selfAwareness": [],
    "productivity": [],
    "lifeHack": [],
    "cultureFest": [],
    "sheIs": [],
    "biography": [],
    "fiction": [],
    "miscellaneous": [],
    "uncategorized": [],
    "periodicals": []
  }
}
